{
    "argentina": {
        "paperwork": "You will need to submit the following documents: \n- Passport\n- Visa application form\n- Financial statement to prove you can support your stay.",
        "steps": "1. Complete the visa application form: Make sure to fill out all required fields accurately. \n2. Schedule an appointment: Book your interview at the nearest Argentine consulate. \n3. Submit documents: On the day of the appointment, bring all necessary documents and expect an interview with a consulate officer."
    },
    "czech": {
        "paperwork": "No extra paperwork is needed aside from your Passport or National ID card, as France is part of the Schengen Zone.",
        "steps": "1. Ensure your Passport or National ID is valid: Make sure your travel documents are up to date.\n2. Prepare for the trip: Although a visa is not required, it is a good idea to have proof of accommodation and return flight tickets.\n3. Enjoy your stay: You can stay visa-free in the Czech Republic for up to 90 days. Keep an eye on the duration of your stay to avoid overstaying."
      },
      "tunisia": {
        "paperwork": "You will need to submit your passport, a student visa application form, a letter of acceptance from an educational institution in Tunisia, and proof of sufficient funds for your stay.",
        "steps": "1. Obtain a letter of acceptance: Secure your place at an educational institution in Tunisia.\n2. Complete the student visa application form: Fill out the required information and make sure all details are accurate.\n3. Gather required documents: Compile your passport, letter of acceptance, and proof of funds.\n4. Schedule an appointment: Book a time slot with the nearest Tunisian consulate to submit your application.\n5. Attend the appointment: Go to the consulate, submit your documents, and pay the visa application fee.\n6. Wait for approval: Once approved, you'll receive your student visa, which allows you to stay in Tunisia for up to 3 months as a student.\n7. Arrive in Tunisia: Upon arrival, you may be required to show your visa and supporting documents at immigration control.\n8. Register locally: Check with your educational institution about any local registration or additional paperwork that may be needed."
      },
      "india": {
        "paperwork": "Submit your passport, completed e-Visa application form, proof of acceptance from an educational institution in India, recent passport-size photographs, and proof of sufficient funds.",
        "steps": "1. Secure Admission: Obtain a letter of acceptance from an accredited educational institution in India.\n2. Complete the e-Visa Application: Go to the official Indian e-Visa portal and fill out the student visa application form.\n3. Gather Required Documents: Make sure you have your passport, letter of acceptance, recent photographs, and proof of funds ready.\n4. Pay the e-Visa Fee: Complete the payment online as per the instructions on the e-Visa portal.\n5. Upload Documents: Upload all required documents on the portal and double-check all the information before submitting.\n6. Receive e-Visa: Upon approval, you will receive your e-Visa via email. Make sure to print it out for your journey.\n7. Pre-Travel Preparations: Book your flights, ensure your accommodation, and prepare any other necessary arrangements.\n8. Arrive in India: Upon arrival, present your e-Visa, letter of acceptance, and proof of funds at immigration control.\n9. Local Registration: After your arrival, you may need to register with the local Foreigners Regional Registration Office (FRRO) within 14 days."
      }      
      
  }
  